<?php
// +----------------------------------------------------------------------
// | 系统版本 V1.0
// +----------------------------------------------------------------------
// | 2015年10月19日
// +----------------------------------------------------------------------
// | Author: David (626218581@qq.com)
// +----------------------------------------------------------------------

// 后台主程序端
// 应用入口

// 检测PHP环境
if(version_compare(PHP_VERSION,'5.3.0','<'))  die('require PHP > 5.3.0 !');

// 开启调试模式 建议开发阶段开启 部署阶段注释或者设为false
define('APP_DEBUG',True);

// 定义应用目录
define('APP_PATH','./APP/');

// 引入ThinkPHP入口文件
require './ThinkPHP/ThinkPHP.php';